
/**
  ******************************************************************************
  * @file    DEBUG.c
  * @author  wolfik
  * @version V1.0.0
  * @date    22-03-2016
  * @brief   Функции Debug
  ******************************************************************************
  * @attention
  * В данном файле находятся функции, которые используются для отладки.
  * ****************************************************************************
  * HOW TO
  ******************************************************************************
  * 1) Инициализировать UART для работы вызвав функцию InitDEBUG()
  * 2) Для отправки одного отдельного символа используй  DEBUGSendChar()
  * 3) Для отправки массива символов используется DEBUGSendMass()
  *
  * 
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "Debug.h"
/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/


/* Private functions ---------------------------------------------------------*/

/**
  * @brief Инициализация UART Передатчика для отладки.
  * скорость задана в файле main.h.
  * @param  None
  * @retval None
  */
void InitDEBUG(void)
{
	int UBRValue =UBRValued;
	
	UBRRL	=	(uint8_t)	(UBRValue);
	UCSRA	&=~(1<<U2X);
	UCSRC	=  (1<<URSEL)|(1<<UCSZ1) | (1<<UCSZ0);
	UCSRB	|= (1<<TXEN) ;
}

/**
  * @brief  Отправка символа в DEBUG.
  * @param  char symbol - символ или число необходимое отправить 
  * @retval None
  */
void DEBUGSendChar(char symbol)
{
	while (!(UCSRA & (1<<UDRE)));
	UDR = symbol;	
}
/**
  * @brief  Отправка массива символов в DEBUG.
  * @param  uint8_t * pData - указатель на начало массива символов
  * @param	uint8_t sizedata - Размер массива в байтах.
  * @retval None
  */
void DEBUGSendMass(uint8_t * pData, uint8_t sizedata)
{
	for (int NumberSymbol = 0;NumberSymbol < sizedata;NumberSymbol++)
	{
		DEBUGSendChar((char) *(pData+NumberSymbol));
	}
}


/******************* AME 2016*****END OF FILE****/
