/**
  ******************************************************************************
  * @file    MUP.c
  * @author  Wolfik 
  * @version v0.0.0.1
  * @date    22-03-2016
  * @brief   Main program body
  ******************************************************************************
  * @attention
  *
  * Программа управления подсветкой на монитора. В данном файле находятся
  * основной алгоритм работы, инициализации переферии и т.д
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include <avr/io.h>
#include "main.h"
/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/


/**
  * @brief  Main program.
  * @param  None
  * @retval None
  */
int main(void)
{
	InitAll();
	while(1)
    {
        LED0ON;
		for (int i;i<1000000;i++);
		LED0OFF;
		for (int i;i<1000000;i++);
	}
}
/**
  * @brief  Инициализирует Работу светодиода. Светодиод не несет полезной нагрузки,
  * применяется для проверки состояния устройства. Подключен к PB0. 
  * @param  None
  * @retval None
  */
void InitLed0(void)
{
	LEDPORTCONFIG |= (1<<LED0);
}

/**
  * @brief  Инициализирует всю необходимую переферию.
  * @param  None
  * @retval None
  */
void InitAll(void)
{
	InitLed0();
}
/******************* AME 2016*****END OF FILE****/